{"authors": ["Kei Nakagawa", "Mitsuyoshi Imamura", "Kenichi Yoshida"], "sentence": ["In the field of portfolio management, practitioners are focusing increasingly on risk-based portfolios, which use methods such as the minimum variance (MV), risk parity (RP), and maximum diversification (MD) to construct portfolios based solely on covariance matrices. Risk-based portfolios outperform traditional mean-variance portfolios (Markowitz 1952) and market capitalization-weighted portfolio, as shown in various empirical studies on stock selection (De Carvalho et al. 2012) and asset allocation (Chaves et al. 2011). As a result, the number of investment trusts and pension funds designed based on this concept are increasing.", "It is well known that the performance of a mean-variance portfolio depends on the accuracy of the estimations of the inputs (Michaud 1989). In contrast, risk-based portfolios do not need to estimate expected returns, which are notoriously unstable and difficult to predict (Merton 1980). This is one of the main motivations for using a risk-based portfolio rather than a mean-variance portfolio. Recently, Ardia et al. (2017) estimated the accuracy of covariance matrices in terms of the weights of several risk-based portfolios. However, to the best of our knowledge, no studies have examined the relation between the performance of risk-based portfolios and the estimated accuracy of covariance matrices.", "In this research, we compare the performances of risk-based portfolios for several estimation methods of covariance matrices. In addition, we propose a highly accurate estimation method that combines nonlinear shrinkage and the cDCC-GARCH model, called the cDCC-NLS method.", "To estimate the covariance matrix in financial time series, it is necessary consider two important aspects: the cross section and the time series. With regard to the cross section, we have the difficulty of correcting the biases of the sample covariance matrix eigenvalues in a large number of time series. A popular method used to achieve this is the linear shrinkage method (LS) and its successor, the nonlinear shrinkage method (NLS), proposed by Ledoit and Wolf (2012). With regard to the time series aspect, we have to account for volatility clustering and time-varying correlations. To introduce a time-varying volatility and correlation structure, Engle (2002) proposed using the dynamic conditional correlation GARCH (DCC) model. Aielli (2013) modified the DCC model, proposing the corrected DCC-GARCH (cDCC) model. We combine the cDCC model and the NLS method to deliver an improved estimation of the covariance matrix. We compare various (c)DCC models (DCC, cDCC, DCC-LS, cDCC-LS, DCC-NLS, and cDCC-NLS) to estimate the accuracy of each method. To test whether the estimation accuracy of the covariance matrices affects the performance of the risk-based portfolio, we compare the accuracy of each method, including the proposed method. Then, we check whether the improvement affects the performance of risk-based portfolios in the Japanese stock market.", "The proposed method (cDCC-NLS) offers the best estimation accuracy of the six methods. Furthermore, we confirm that, unlike MV, RP and MD do not depend on the estimation accuracy of the covariance matrix.", "The remainder of the paper is organized as follows. Section 2 gives a brief description of risk-based portfolios and the estimation method using covariance matrices. Section 3 describes the proposed method, which consists of a cDCC-GARCH model and the nonlinear shrinkage method. Section 4 discusses a simulation of a large number of stocks in Japanese markets. Lastly, Section 5 concludes the paper.", "In this section, we summarize the well-known risk-based portfolios examined in previous research. Suppose there are N risky assets, with rates of returns given by the random variables \n\n\nR\n=\n\n\n(\n\nR\n1\n\n,\n⋯\n,\n\nR\nN\n\n)\n\nT\n\n\n\n. Let \n\n\nw\n=\n\n\n(\n\nw\n1\n\n,\n⋯\n,\n\nw\nN\n\n)\n\nT\n\n\n\n be a weighting vector for each asset, \n\n\nμ\n=\n\n\n(\n\nμ\n1\n\n,\n⋯\n,\n\nμ\nN\n\n)\n\nT\n\n\n\n be an expected return vector, and \n\n\nΣ\n=\nE\n[\n\n(\n\nR\n−\nμ\n\n)\n\n\n\n(\n\nR\n−\nμ\n\n)\n\nT\n\n]\n\n\n be a covariance matrix. Thus, a portfolio’s variance and risk (standard deviation) can be expressed as \n\n\n\nσ\nP\n2\n\n=\n\n\nw\n\nT\n\nΣ\nw\n\n\n.", "An MV portfolio has the lowest risk of portfolios based on the mean-variance method developed by Markowitz (1952). Specifically, the optimization problem is to minimize the portfolio variance subject to short-sales constraints and a budget constraint in which the sum of the weights is \n\n1\n\n, denoting a vector of ones of dimension \n\n\nN\n×\n1\n\n\n: \n\n\n\n\n\n\n\n\nmin\nw\n\n\n\nσ\nP\n2\n\n=\n\nw\nT\n\nΣ\nw\n\n\n\n\n\n\n\n\n(1)\n\n\n\n\n\n\n\n\n\ns\n.\nt\n,\n\nw\nT\n\n1\n=\n1\n\n\n\n\n\n\n\n\n(2)\n\n\n\n\n\n\n\n\n\nw\n>\n0\n.\n\n\n\n\n\n\n\n\n(3)\n\n", "In the absence of the short-sales constraints (Equation (3)), the analytical solution is \n\n\n\nw\n∗\n\n=\n\n\n\nΣ\n\n−\n1\n\n\n1\n\n\n\n1\nT\n\n\nΣ\n\n−\n1\n\n\n1\n\n\n\n\n. The MV portfolio is an efficient portfolio in terms of the mean-variance if the expected returns of all assets are the same.", "Haugen and Baker (1991) and Clarke et al. (2006) investigated the MV portfolio and showed that the cumulative excess returns of MV portfolios in the U.S. stock market have been slightly higher than those of the market over the previous 42 years. Scherer (2011) showed that an MV portfolio tends to hold a low beta and low residual-risk stocks. These results are known as low volatility anomalies.", "The RP portfolio assigns the same risk budget to each asset (Qian 2005). This way, no asset class can be dominant in driving the volatility of the portfolio. We present a rigorous mathematical definition for the RP portfolio using the marginal risk contribution (MRC) and the risk contribution (RC), following Maillard et al. (2010). The definition characterizes the RP portfolio in terms of an equal RC for each asset, as follows: \n\n\n\n\n\n\n\nM\nR\nC\n=\n\n\n∂\n\nσ\nP\n\n\n\n∂\nw\n\n\n=\n\n\nΣ\nw\n\n\nσ\nP\n\n\n,\nM\nR\n\nC\ni\n\n=\n\n\n\n(\nΣ\nw\n)\n\ni\n\n\nσ\nP\n\n\n\n\n\n\n\n\n\n\n(4)\n\n\n\n\n\n\n\n\n\n\nσ\nP\n\n=\n\n∑\n\ni\n=\n1\n\nN\n\n\nw\ni\n\n×\nM\nR\n\nC\ni\n\n=\n\n\nw\n\nT\n\nM\nR\nC\n\n\n\n\n\n\n\n\n(5)\n\n\n\n\n\n\n\n\n\nR\n\nC\ni\n\n=\n\n\n\nw\ni\n\n×\nM\nR\n\nC\ni\n\n\n\nσ\nP\n\n\n.\n\n\n\n\n\n\n\n\n(6)\n\n", "Maillard et al. (2010) propose the following optimization problem (7)–(9) to determine the optimal RP portfolio weights when short selling and when leverage is not allowed. In addition, Maillard et al. (2010) show that the optimization program in (7)–(9) is a convex program and that it has a unique local minimum.\n\n\n\n\n\n\n\n\n\nmin\nw\n\n\n\n∑\n\ni\n=\n1\n\nN\n\n\n∑\n\nj\n=\n1\n\nN\n\n\n\nR\n\nC\ni\n\n−\nR\n\nC\nj\n\n\n2\n\n\n\n\n\n\n\n\n\n(7)\n\n\n\n\n\n\n\n\n\ns\n.\nt\n,\n\nw\nT\n\n1\n=\n1\n\n\n\n\n\n\n\n\n(8)\n\n\n\n\n\n\n\n\n\nw\n>\n0\n\n\n\n\n\n\n\n\n(9)\n\n", "Choueifaty and Coignard (2008) proposed the MD portfolio to benefit most from the diversification effect of the portfolio. They define the diversification ratio of any portfolio as \n\n\nD\nR\n(\nw\n)\n\n\n. Here, \n\n\nD\nR\n(\nw\n)\n\n\n is the ratio of the weighted average of the volatilities divided by the portfolio volatility. The MD portfolio maximizes the diversification ratio. Intuitively, this portfolio incorporates more low-correlated assets. From the viewpoint of the Sharpe ratio-maximized portfolio, it tries to minimize the volatility and the correlation, rather than the expected return.\n\n\n\n\n\n\n\n\n\nmax\nw\n\n\nD\nR\n\n(\nw\n)\n\n=\n\n\n\n∑\n\ni\n=\n1\n\nN\n\n\nw\ni\n\n\nσ\ni\n\n\n\nσ\nP\n\n\n.\n\n\n\n\n\n\n\n\n(10)\n\n", "In order to maximize \n\n\nD\nR\n(\nw\n)\n\n\n, it is necessary to reduce the denominator or to increase the numerator. The numerator and the denominator are linked through the volatility term. Because the denominator has a correlation term, a portfolio with a low correlation is constructed as a result.", "The difficulty of estimating covariance matrices in financial time series arises from two aspects: the cross section and time series.", "In the cross section, the challenge is to correct the biases of the sample covariance matrix eigenvalues. When the number of assets under consideration is large, especially relative to the number of historical return observations, the sample covariance matrix is estimated with a large error. This is caused by the bias of the eigenvalues of the sample covariance matrix. In order to reduce the estimation error, the linear shrinkage method of Ledoit and Wolf (2004) is often used. This method uniformly corrects all biases of the eigenvalues of the sample covariance matrix.", "In general, the eigenvalues of a small sample are estimated as too small, and those of a large sample are estimated as too large. Therefore, the nonlinear shrinkage method of Ledoit and Wolf (2012) individually corrects each bias of the sample eigenvalues using the random matrix theory. In time series, the challenge is to account for volatility clusteringand time-varying correlations.", "A model that has been shown to be successful in capturing volatility clustering is the autoregressive conditional heteroscedasticity (ARCH) model, introduced by Engle (1982). Then, Bollerslev (1986) generalized the ARCH model (the GARCH model) to make it more realistic.", "To introduce a time-varying correlation structure to these conditional variance models, Engle (2002) proposed the dynamic conditional correlation GARCH (DCC) model. However, Aielli (2013) reveals a weak point of the DCC model, in that it possesses a significant asymptotic bias in the estimator of the sample covariance matrix, which is a constituent of the correlation evolution process. Aielli (2013) subsequently modified the DCC model, proposing the corrected DCC-GARCH (cDCC) model.", "On the other hand, it is well known that estimating the DCC model with a large number of assets is difficult. One of the reasons for this is that we need to invert the conditional correlation matrix when we calculate the log-likelihood function of the DCC model in order to estimate the parameters. Finding the inverse matrix has a computational load of \n\n\nO\n(\n\nN\n3\n\n)\n\n\n. Fortunately, Engle et al. (2008) discovered a way to overcome this hurdle, called the composite likelihood method. The composite likelihood is computed by summing the log-likelihood functions of all contiguous pairs. This requires a computational load of \n\n\nO\n(\nN\n)\n\n\n. We summarize each method in the next section.", "The population covariance matrix \n\nΣ\n\n is a non-random t by N-dimensional positive definite matrix. Let \n\n\nX\nt\n\n\n be a t by N matrix of real independent and identically distributed (i.i.d.) random variables, with a zero mean and unit variance. We only observe \n\n\n\nY\nt\n\n=\n\nX\nt\n\n\n\nΣ\n\n\n1\n/\n2\n\n\n\n\n. Thus, neither \n\n\nX\nt\n\n\n nor \n\nΣ\n\n are observed on their own.", "Let \n\n\n\nΣ\n^\n\n=\n\nΣ\n^\n\n\n(\n\nY\nt\n\n)\n\n\n\n be an estimator of \n\nΣ\n\n. Then, the estimator is said to be rotation-equivariant if it satisfies \n\n\n\nΣ\n^\n\n\n(\n\nAY\nt\n\n)\n\n=\nA\n\nΣ\n^\n\n\n\nA\n\nT\n\n\n\n for any orthogonal matrix \n\nA\n\n. The class of rotation-equivariant estimators of the covariance matrix comprises all estimators that have the same eigenvectors as the sample covariance matrix. Thus, every rotation-equivariant estimator \n\n\nΣ\n^\n\n\n is of the form \n\n\n\nV\nt\n\n\nD\nt\n\n\nV\nt\nT\n\n\n\n where \n\n\nD\nt\n\n\n is a diagonal matrix with eigenvalues \n\n\n(\n\nd\n1\n\n,\n…\n,\n\nd\nt\n\n)\n\n\n as its elements, and where \n\n\nV\nt\n\n\n is a matrix with the ith column as the sample eigenvector. Ledoit and Wolf (2012) found the best \n\n\nΣ\n^\n\n\n under the following loss function in the rotation-equivariant estimator.\n\n\n\n\n\n\nmin\n\nD\nt\n\n\n\n∥\n\n\nV\nt\n\n\nD\nt\n\n\nV\nt\nT\n\n\n−\nΣ\n∥\n\n\n\n\n\n\n(11)\n\n", "Here, \n\n\n∥\nx\n∥\n\n\n is the Frobenius norm, defined as \n\n\n\n∥\nM\n∥\n\n=\n\n\n\nT\nr\n(\nM\n\n\nM\n\nT\n\n)\n\nr\n\n\n\n\n for any \n\n\nr\n×\nm\n\n\n matrix \n\nM\n\n. Its solution is \n\n\n\nD\nt\n*\n\n=\ndiag\n\n(\n\nd\n1\n∗\n\n,\n…\n,\n\nd\nt\n∗\n\n)\n\n\n\n, where \n\n\n\nd\ni\n∗\n\n=\n\nv\ni\nT\n\nΣ\n\nv\ni\n\n\n\n and \n\n\nv\ni\n\n\n is the i th column of \n\n\nV\nt\n\n\n. Therefore, the best rotation-equivariant estimator of the covariance matrix is \n\n\n\n\nS\n\nt\n∗\n\n=\n\nV\nt\n\n\nD\nt\n*\n\n\n\n\nV\nt\n\n\nT\n\n\n\n.", "Ledoit and Péché (2011) showed that \n\n\nd\ni\n∗\n\n\n can be approximated under the following conditions. Let \n\n\nH\nT\n\n\n be the population spectral distribution and let \n\n\nF\nT\n\n\n be the limiting spectral distribution. We assume that \n\n\nH\nT\n\n\n and \n\n\nF\nT\n\n\n converge to the non-random limiting spectral distribution H and F, respectively. Here, \n\n\nτ\n\ni\n,\nT\n\n\n\n denotes the population eigenvalues of \n\nΣ\n\n, and \n\n\nλ\n\ni\n,\nT\n\n\n\n denotes the sample eigenvalues of \n\n\nΣ\n^\n\n\n.\n\n\n\n\n\n\n\n\n\nH\nT\n\n\n(\nx\n)\n\n=\n\n1\nN\n\n\n∑\n\ni\n=\n1\n\nN\n\n\n1\n\n{\nx\n≤\n\nτ\n\ni\n,\nT\n\n\n}\n\n\n,\n\n\n∀\n\nx\n∈\nR\n\n\n\n\n\n\n\n\n(12)\n\n\n\n\n\n\n\n\n\n\nF\nT\n\n\n(\nx\n)\n\n=\n\n1\nN\n\n\n∑\n\ni\n=\n1\n\nN\n\n\n1\n\n{\nx\n≤\n\nλ\n\ni\n,\nT\n\n\n}\n\n\n,\n\n\n∀\n\nx\n∈\nR\n\n\n\n\n\n\n\n\n(13)\n\n\n\n\n\n\n\n\n\n\nH\nT\n\n\n(\nx\n)\n\n⟶\nH\n\n\n\n\n\n\n\n\n(14)\n\n\n\n\n\n\n\n\n\n\nF\nT\n\n\n(\nx\n)\n\n⟶\nF\n.\n\n\n\n\n\n\n\n\n(15)\n\n", "From the random matrix theory, \n\n\nm\nF\n\n\n is quantitatively related to H, where \n\n\nm\nF\n\n\n is the Stieltjes transform of F, and c is \n\n\np\n/\nn\n\n\n (Silverstein 1995).\n\n\n\n\n\n\n\n\n\nm\nF\n\n\n(\nz\n)\n\n=\n\n∫\n\n−\n∞\n\n∞\n\n\n1\n\nλ\n−\nz\n\n\nd\nF\n\n(\nλ\n)\n\n,\n\n\n∀\n\nz\n∈\n\nC\n+\n\n\n\n\n\n\n\n\n\n(16)\n\n\n\n\n\n\n\n\n\n\nm\nF\n\n\n(\nz\n)\n\n=\n\n∫\n\n−\n∞\n\n∞\n\n\n1\n\nτ\n(\n1\n−\nc\n−\nc\nz\n\nm\nF\n\n\n(\nz\n)\n\n)\n−\nz\n\n\nd\nH\n\n(\nτ\n)\n\n\n\n\n\n\n\n\n\n(17)\n\n\n\n\n\n\n\n\n\n\n\nm\n^\n\nF\n\n\n(\nλ\n)\n\n=\n\nlim\n\nz\n∈\n\nC\n+\n\n→\nλ\n\n\n\nm\nF\n\n\n(\nz\n)\n\n\n\n\n\n\n\n\n\n(18)\n\n", "From the above, \n\n\nd\ni\n∗\n\n\n can be approximated as follows:\n\n\n\n\n\nd\ni\n∗\n\n=\n\n\nλ\ni\n\n\n\n|\n1\n−\nc\n−\nc\n\n\nλ\ni\n\n\n\nm\n^\n\nF\n\n\n(\n\nλ\ni\n\n)\n\n\n\n|\n\n2\n\n\n\n.\n\n\n\n\n\n(19)\n\n", "Suppose there are N risky assets. Let \n\n\n\nr\nt\n\n=\n\n\n(\n\nr\n\n1\nt\n\n\n,\n…\n,\n\nr\n\nN\nt\n\n\n)\n\nT\n\n\n\n be the return vector at time \n\n\nt\n(\n1\n≤\nt\n≤\nT\n)\n\n\n. Then, \n\n\nE\n(\n\nr\nt\n\n|\n\nF\n\nt\n−\n1\n\n\n)\n=\n0\n\n\n is defined as the conditional mean vector and \n\n\nV\n\n(\n\nr\nt\n\n|\n\nF\n\nt\n−\n1\n\n\n)\n\n=\n\nH\nt\n\n\n\n is defined as the conditional covariance matrix. We assume that the joint distribution of returns follows a multivariate Gaussian distribution. Then, \n\n\nF\n\nt\n−\n1\n\n\n\n is the \n\nσ\n\n-algebra that contains information of what happened up to time \n\n\nt\n−\n1\n\n\n.", "Engle (2002) defines the DCC model using Equations (21)–(25). Here, \n\n\nH\nt\n\n\n is decomposed into \n\n\nD\nt\n2\n\n\n, the conditional variance of each asset, and \n\n\nR\nt\n\n\n, the conditional correlation matrix.1", "In the DCC model, both the variance and the correlations between the assets are designed to be time-varying. The elements in the diagonal matrix \n\n\nD\nt\n\n\n are standard deviations from univariate GARCH models. Note that the univariate GARCH models can have different orders. Often the simplest model, GARCH(1,1) is adequate. Hereafter, we assume \n\n\nD\nt\n\n\n is driven by GARCH(1,1). Then, \n\n\nR\nt\n\n\n is decomposed into \n\n\nQ\nt\n\n\n to ensure that all elements are less than or equal to one, by definition of the correlation. Several conditions are imposed on the parameters a and b in order to guarantee that \n\n\nH\nt\n\n\n is positive definite. The scalar values a and b must satisfy: \n\n\na\n>\n0\n\n\n, \n\n\nb\n>\n0\n\n\n and \n\n\na\n+\nb\n<\n1\n\n\n. In addition, the starting value of \n\n\nQ\nt\n\n\n has to be positive definite to guarantee that \n\n\nH\nt\n\n\n is positive definite. In addition, \n\nS\n\n is the unconditional covariance matrix of the standardized errors, \n\n\nε\nt\n\n\n.\n\n\n\n\n\n\n\n\n\nr\nt\n\n\n|\n\n\nF\n\nt\n−\n1\n\n\n∼\nN\n\n(\n0\n,\n\nH\nt\n\n)\n\n\n\n\n\n\n\n\n\n(20)\n\n\n\n\n\n\n\n\n\n\nH\nt\n\n=\n\nD\nt\n\n\nR\nt\n\n\nD\nt\n\n\n\n\n\n\n\n\n\n(21)\n\n\n\n\n\n\n\n\n\n\nD\nt\n2\n\n=\ndiag\n\n(\n\nω\ni\n\n)\n\n+\ndiag\n\n(\n\nα\ni\n\n)\n\n∘\n\n\n\nr\n\nt\n−\n1\n\n\n\nT\n\n\nr\n\nt\n−\n1\n\n\n+\ndiag\n\n(\n\nβ\ni\n\n)\n\n∘\n\nD\n\nt\n−\n1\n\n2\n\n\n\n\n\n\n\n\n\n(22)\n\n\n\n\n\n\n\n\n\n\nε\nt\n\n=\n\n\n\nD\nt\n\n\n\n−\n1\n\n\n\nr\nt\n\n\n\n\n\n\n\n\n\n(23)\n\n\n\n\n\n\n\n\n\n\nR\nt\n\n=\n\n\n\nQ\nt\n\n\n\n−\n\n1\n2\n\n\n\n\nQ\nt\n\n\n\n\nQ\nt\n\n\n\n−\n\n1\n2\n\n\n\n\n\n\n\n\n\n\n\n(24)\n\n\n\n\n\n\n\n\n\n\nQ\nt\n\n=\nS\n\n(\n1\n−\na\n−\nb\n)\n\n+\na\n\n\n\nε\n\nt\n−\n1\n\n\n\nT\n\n\nε\n\nt\n−\n1\n\n\n+\nb\n\nQ\n\nt\n−\n1\n\n\n\n\n\n\n\n\n\n\n(25)\n\n", "Divide the parameters of DCC into two groups: \n\n\nθ\n=\n(\n\nθ\n1\n\n,\n…\n,\n\nθ\nN\n\n)\n\n\n, where \n\n\n\nθ\ni\n\n=\n\n(\n\nω\ni\n\n,\n\nα\ni\n\n,\n\nβ\ni\n\n)\n\n\n\n are the parameters of the univariate GARCH model for the ith asset series, and the correlation structure in Equation (24) is driven by Equation (25), which has the parameters \n\n\nϕ\n=\n(\na\n,\nb\n)\n\n\n.", "When \n\n\nr\nt\n\n\n follows a multivariate Gaussian distribution, the log-likelihood function for \n\n\nL\n(\nθ\n,\nϕ\n)\n\n\n can be written as the sum of the volatility part \n\n\n\nL\nV\n\n\n(\nθ\n)\n\n\n\n and the correlation part \n\n\n\nL\nC\n\n\n(\nθ\n,\nϕ\n)\n\n\n\n.\n\n\n\n\n\n\n\n\nL\n\n(\nθ\n,\nϕ\n)\n\n=\n\nL\nV\n\n\n(\nθ\n)\n\n+\n\nL\nC\n\n\n(\nθ\n,\nϕ\n)\n\n\n\n\n\n\n\n\n\n(26)\n\n\n\n\n\n\n\n\n\n\nL\nV\n\n\n(\nθ\n)\n\n=\n−\n\n1\n2\n\n\n∑\n\nt\n=\n1\n\nT\n\n\n(\nn\nln\n\n2\nπ\n\n+\nln\n\n\n|\n\n\nD\nt\n\n\n\n|\n\n2\n\n\n+\n\n\n\nr\nt\n\n\nT\n\n\n\n\nD\nt\n\n\n\n−\n2\n\n\n\nr\nt\n\n)\n\n\n\n\n\n\n\n\n\n(27)\n\n\n\n\n\n\n\n\n\n\nL\nC\n\n\n(\nθ\n,\nϕ\n)\n\n=\n−\n\n1\n2\n\n\n∑\n\nt\n=\n1\n\nT\n\n\n(\nln\n\n\n|\n\n\nR\nt\n\n\n|\n\n\n+\n\n\n\nε\nt\n\n\nT\n\n\n\n\nR\nt\n\n\n\n−\n1\n\n\n\nε\nt\n\n−\n\n\n\nε\nt\n\n\nT\n\n\nε\nt\n\n)\n\n\n\n\n\n\n\n\n\n(28)\n\n", "However, estimating the correctly specified log-likelihood is difficult. Hence, the DCC model is designed to allow for a two-step estimation.", "Compared with the log-likelihood in the univariate case, we find that the log-likelihood in \n\n\n\nL\nV\n\n\n(\nθ\n)\n\n\n\n is the sum of the log-likelihoods of the univariate GARCH equations of N assets. Thus, the parameters of the different univariate models may be determined separately. In the first step, the parameters of the univariate GARCH models are estimated for each asset series. From this step, the parameter set \n\nθ\n\n is estimated. When estimating \n\nθ\n\n, we can also estimate the standardized errors \n\n\nε\nt\n\n\n, which can then be used to estimate \n\nS\n\n. In the second step, the parameter \n\nϕ\n\n is estimated using \n\nθ\n\n and \n\nS\n\n. The method used to estimated \n\nS\n\n with the standardized errors \n\n\nε\nt\n\n\n is called correlation targeting (Engle 2009). Here, \n\nS\n\n can be estimated using the sample covariance matrix of \n\n\nε\nt\n\n\nStep 1Maximize the log-likelihood \n\n\n\nL\nV\n\n\n(\nθ\n)\n\n\n\n to determine \n\n\n\nD\nt\n\n^\n\n\n.\n\n\n\n\n\n\nθ\n^\n\n=\n\nmax\nθ\n\n\nL\nV\n\n\n(\nθ\n)\n\n.\n\n\n\n\n\n(29)\n\nStep 2After estimating \n\nθ\n\n, estimate the standardized errors \n\n\nε\nt\n\n\n. Here, \n\nS\n\n can be estimated using the moment estimator \n\n\n\nS\n^\n\n=\n\n1\n2\n\n\n∑\n\nt\n=\n1\n\nT\n\n\n\nε\n^\n\nt\n\n\n\n\n\nε\n^\n\nt\n\n\nT\n\n,\n\n\nε\n^\n\nt\n\n=\n\n\n\n\nD\n^\n\nt\n\n\n\n−\n1\n\n\n\nr\nt\n\n\n\n.Then, maximize the log-likelihood \n\n\n\nL\nC\n\n\n(\nθ\n,\nϕ\n)\n\n\n\n to determine \n\nϕ\n\n.\n\n\n\n\n\n\nϕ\n^\n\n=\n\nmax\nϕ\n\n\nL\nC\n\n\n(\n\nθ\n^\n\n,\nϕ\n)\n\n.\n\n\n\n\n\n(30)\n\n", "Maximize the log-likelihood \n\n\n\nL\nV\n\n\n(\nθ\n)\n\n\n\n to determine \n\n\n\nD\nt\n\n^\n\n\n.\n\n\n\n\n\n\nθ\n^\n\n=\n\nmax\nθ\n\n\nL\nV\n\n\n(\nθ\n)\n\n.\n\n\n\n\n\n(29)\n\n", "After estimating \n\nθ\n\n, estimate the standardized errors \n\n\nε\nt\n\n\n. Here, \n\nS\n\n can be estimated using the moment estimator \n\n\n\nS\n^\n\n=\n\n1\n2\n\n\n∑\n\nt\n=\n1\n\nT\n\n\n\nε\n^\n\nt\n\n\n\n\n\nε\n^\n\nt\n\n\nT\n\n,\n\n\nε\n^\n\nt\n\n=\n\n\n\n\nD\n^\n\nt\n\n\n\n−\n1\n\n\n\nr\nt\n\n\n\n.", "Then, maximize the log-likelihood \n\n\n\nL\nC\n\n\n(\nθ\n,\nϕ\n)\n\n\n\n to determine \n\nϕ\n\n.\n\n\n\n\n\n\nϕ\n^\n\n=\n\nmax\nϕ\n\n\nL\nC\n\n\n(\n\nθ\n^\n\n,\nϕ\n)\n\n.\n\n\n\n\n\n(30)\n\n", "Aielli (2013) reveals a weak point in the DCC model. The correlation targeting estimation is based on the assumption that \n\n\n\nQ\n¯\n\n=\n\n1\nT\n\n\n∑\n\nt\n=\n1\n\nT\n\n\nQ\nt\n\n\n\n is equal to \n\n\nS\n^\n\n\n. However, this assumption cannot be justified because the unconditional expectation of \n\n\nQ\nt\n\n\n is not equal to the unconditional expectation of \n\n\n\n\nε\n^\n\nt\n\n\n\n\n\nε\n^\n\nt\n\n\nT\n\n\n\n.", "Thus, Aielli (2013) proposes a corrected DCC-GARCH (cDCC) model, which is tractable and easy to implement. In this model, the conditional correlation driving the process \n\n\nQ\nt\n\n\n is defined as follows:\n\n\n\n\n\n\n\n\n\nQ\nt\n\n=\nΨ\n\n(\n1\n−\na\n−\nb\n)\n\n+\na\n\nε\n\nt\n−\n1\n\n∗\n\n\nε\n\nt\n−\n1\n\n\n∗\nT\n\n\n+\nb\n\nQ\n\nt\n−\n1\n\n\n\n\n\n\n\n\n\n\n(31)\n\n\n\n\n\n\n\n\n\n\nε\n\nt\n\n∗\n\n=\ndiag\n\n\n(\n\nQ\nt\n\n)\n\n\n1\n2\n\n\n\nε\nt\n\n\n\n\n\n\n\n\n\n(32)\n\n", "The form of the correlation driving the process of the DCC model is modified in such a way that the unconditional expectation of \n\n\nQ\nt\n\n\n is equal to the unconditional expectation of \n\n\n\nε\n\nt\n\n∗\n\n\nε\n\nt\n\n\n∗\nT\n\n\n\n\n. Then, \n\nΨ\n\n can be estimated consistently using the sample covariance matrix of \n\n\n\nε\n\nt\n\n∗\n\n\n\n.", "The estimation of the cDCC model is based on maximizing the same log-likelihood function as that of the DCC model. In the first step, the parameter vector \n\nθ\n\n of the univariate GARCH models is estimated. Using \n\nθ\n\n, estimate the modified errors \n\n\n\nε\n\nt\n\n∗\n\n\n\n, the sample covariance matrix of which can be used to estimate \n\nΨ\n\n. In the second step, the parameter \n\nϕ\n\n is estimated using \n\n\nθ\n^\n\n\n.", "Aielli (2013) performed a simulation study, showing that there is a considerable bias in the estimator of \n\nS\n\n for the DCC, even when the cross-section size is small. However, he also shows there is a downward bias in a and b, which is a recognized problem when using DCC with large systems (Engle 2002).", "It is well known that estimating the (c)DCC model in the case of a large number of assets is difficult. One of the reasons for this is that we need to invert the conditional correlation matrix when we maximize the log-likelihood \n\n\n\nL\nC\n\n\n(\nθ\n,\nϕ\n)\n\n\n\n. Finding the inverse matrix has a computational load of \n\n\nO\n(\n\nN\n3\n\n)\n\n\n. Engle et al. (2008) overcome this problem using what they call the composite likelihood method, which can be traced back to Lindsay (1988). The composite likelihood of the (c)DCC model is based on subsets of observations, for example, a subset of two assets’ returns, \n\n\n\nY\njt\n\n=\n\n\n(\n\nr\n\n1\nj\n,\nt\n\n\n,\n\nr\n\n2\nj\n,\nt\n\n\n)\n\nT\n\n,\nj\n=\n1\n,\n…\nN\n\n\n. The conditional variance of \n\n\nY\njt\n\n\n is \n\n\nH\njt\n\n\n.2 Subsets can be selected in various ways: all possible combinations of pairs of assets (\n\n\nO\n(\n\nN\n2\n\n)\n\n\n), contiguous pairs (\n\n\nO\n(\nN\n)\n\n\n), or subsets of pairs selected randomly (\n\n\nO\n(\n1\n)\n\n\n). The simulation study in Engle et al. (2008) shows that the results for different types of subsets are approximately the same. We use the composite likelihood estimator based on all contiguous pairs because it is the most scalable of those available.\n\n\n\n\n\n\n\n\n\nY\njt\n\n\n|\n\n\nF\n\nt\n−\n1\n\n\n∼\nN\n\n(\n0\n,\n\nH\njt\n\n)\n\n\n\n\n\n\n\n\n\n(33)\n\n\n\n\n\n\n\n\n\n\nH\njt\n\n=\n\nD\njt\n\n\nR\njt\n\n\nD\njt\n\n\n\n\n\n\n\n\n\n(34)\n\n\n\n\n\n\n\n\n\n\nD\njt\n2\n\n=\ndiag\n\n(\n\nω\ni\n\n)\n\n+\ndiag\n\n(\n\nα\ni\n\n)\n\n∘\n\nY\n\njt\n−\n1\n\nT\n\n\nY\n\njt\n−\n1\n\n\n+\ndiag\n\n(\n\nβ\ni\n\n)\n\n∘\n\nD\n\njt\n−\n1\n\n2\n\n\n\n\n\n\n\n\n\n(35)\n\n\n\n\n\n\n\n\n\n\nε\njt\n\n=\n\nD\njt\n\n−\n1\n\n\n\nY\njt\n\n\n\n\n\n\n\n\n\n(36)\n\n\n\n\n\n\n\n\n\n\nQ\njt\n\n=\n\nS\nj\n\n\n(\n1\n−\na\n−\nb\n)\n\n+\na\n\nε\n\njt\n−\n1\n\nT\n\n\nε\n\njt\n−\n1\n\n\n+\nb\n\nQ\n\njt\n−\n1\n\n\n\n\n\n\n\n\n\n\n(37)\n\n\n\n\n\n\n\n\n\n\nR\njt\n\n=\n\nQ\njt\n\n−\n\n1\n2\n\n\n\n\nQ\njt\n\n\nQ\njt\n\n−\n\n1\n2\n\n\n\n\n\n\n\n\n\n\n\n(38)\n\n", "Here, \n\n\nS\n^\n\n\n can be estimated using the moment estimator \n\n\n\nS\n^\n\n=\n\n1\n2\n\n\n∑\n\nt\n=\n1\n\nT\n\n\n\nε\n^\n\njt\n\n\n\nε\n^\n\njt\nT\n\n\n\n. The parameter vector \n\n\n\nϕ\n^\n\n=\n\n(\na\n,\nb\n)\n\n\n\n is estimated by maximizing the average of the log-likelihood function \n\n\n\nL\n\nC\nL\n\n\n\n(\n\nθ\n^\n\n,\nϕ\n)\n\n\n\n among all contiguous pairs, rather than maximizing \n\n\n\nmax\nϕ\n\n\nL\nC\n\n\n(\n\nθ\n^\n\n,\nϕ\n)\n\n\n\n in Step 2.\n\n\n\n\n\n\n\n\n\nϕ\n^\n\n=\n\nmax\nϕ\n\n\nL\n\nC\nL\n\n\n\n(\n\nθ\n^\n\n,\nϕ\n)\n\n\n\n\n\n\n\n\n\n(39)\n\n\n\n\n\n\n\n\n\n\nL\n\nC\nL\n\n\n\n(\n\nθ\n^\n\n,\nϕ\n)\n\n=\n\n∑\n\nt\n=\n1\n\nT\n\n\n1\nN\n\n\n∑\n\nj\n=\n1\n\nN\n\nlog\n\nL\n\nj\n,\nt\n\n\n\n(\nϕ\n)\n\n\n\n\n\n\n\n\n\n(40)\n\n\n\n\n\n\n\n\n\n\nL\n\nj\n,\nt\n\n\n\n(\nϕ\n)\n\n=\n−\n\n1\n2\n\n\n∑\n\nt\n=\n1\n\nT\n\n\n(\nln\n\n\n|\n\n\nR\njt\n\n\n|\n\n\n+\n\nε\njt\nT\n\n\nR\njt\n\n−\n1\n\n\n\nε\njt\n\n−\n\nε\njt\nT\n\n\nε\njt\n\n)\n\n\n\n\n\n\n\n\n\n(41)\n\n", "As described above, the estimation of the covariance matrix is problematic in terms of the cross section and the time series. To combine these two aspects, Hafner and Reznikova (2012) proposed an estimation method combining linear shrinkage and the DCC-GARCH model (DCC-LS), and Engle et al. (2017) proposed an estimation method combining nonlinear shrinkage and the DCC-GARCH model (DCC-NLS). We propose a highly accurate estimation method that combines nonlinear shrinkage and the cDCC-GARCH model, called the cDCC-NLS method. To summarize, the cDCC-NLS estimation follows a two-step process:Step 1For each asset, fit a univariate GARCH(1,1) model.Step 2Estimate the unconditional covariance matrix of the standardized errors using the nonlinear shrinkage method, and then maximize the composite likelihood of the cDCC model.", "For each asset, fit a univariate GARCH(1,1) model.", "Estimate the unconditional covariance matrix of the standardized errors using the nonlinear shrinkage method, and then maximize the composite likelihood of the cDCC model.", "In the estimation of Step 2, Hafner and Reznikova (2012) used the sample covariance matrix with the linear shrinkage estimator (DCC-LS). Engle et al. (2017) later replaced this with the nonlinear shrinkage estimator (DCC-NLS). We combine nonlinear shrinkage and the cDCC-GARCH model and confirm its advantages in the next section.", "In order to check whether the performance of risk-based portfolios depends on the estimation accuracy of the covariance matrices, it is necessary to confirm (1) the estimation accuracy of each method, and (2) the effect of the estimation accuracy on performance.", "In this section, we first compare the estimation accuracy of the covariance matrix using various (c)DCC models. We evaluate the covariance matrix estimation accuracy following Engle et al. (2017). Next, we examine the effect of the difference in the estimation accuracy on the performance of the risk-based portfolios.", "In this section, we perform a Monte Carlo simulation to compare the estimation accuracy of the parameters of various (c)DCC models: the DCC, cDCC, DCC-LS, cDCC-LS, DCC-NLS, and cDCC-NLS models. Engle et al. (2017) defines an error function between the true covariance matrix generated by a (c)DCC model and the estimation. On the other hand, because of the sample estimator, the LS and NLS methods do not handle true covariance matrices at each time point, which means the errors cannot be calculated in the same way as in the (c)DCC model. Therefore, we limit our discussion to the (c)DCC model.", "In order to compare our results with those of previous studies (Hafner and Reznikova 2012; Engle et al. 2017), we run a simulation study using the same setup. Let the covariance matrix at each time point of the DCC model, given a certain unconditional covariance and parameters, be a true covariance matrix. We generate random numbers according to the true DCC model, which we then use to estimate the covariance matrix. An error between the estimated covariance matrix and the true covariance matrix is defined as the estimation accuracy.", "As in the previous studies, we estimate the unconditional population covariance matrix from the \n\n\nN\n∈\n{\n100\n,\n500\n,\n1000\n}\n\n\n most liquid stocks in the TOPIX index, using 60 months of daily data from January 2005 through December 2009. We then simulate a (c)DCC model using the unconditional population covariance matrix and the parameters \n\n\na\n=\n0.05\n\n\n and \n\n\nb\n=\n0.93\n\n\n. The univariate volatility dynamics are GARCH(1,1) models with identical parameters \n\n\n\n(\n\nω\ni\n\n,\n\nα\ni\n\n,\n\nβ\ni\n\n)\n\n=\n\n(\n0.01\n,\n0.05\n,\n0.9\n)\n\n\n\n across all stocks \n\n\ni\n=\n1\n,\n…\n,\nN\n\n\n. For each simulation, we generate an \n\n\nN\n×\nT\n\n\n matrix of simulated returns, where the sample size is \n\n\nT\n=\n1250\n\n\n. We run the simulation study for the same setup, with the exception of the unconditional population covariance matrix. Because we study the Japanese stock market in the next section, we use data on Japanese stocks to define the true unconditional covariance matrix.", "First, we check the estimation accuracy of the (c)DCC model parameters \n\n\na\n=\n0.05\n\n\n and \n\n\nb\n=\n0.93\n\n\n. The estimation results for each model are shown in Table 1 and Table 2. Table 1 and Table 2 show the average values and standard deviations of \n\n\n\n10\n5\n\n/\nN\n\n\n estimates of each parameter \n\n\n(\na\n,\nb\n)\n\n\n. There is no downward bias in the parameters described by Engle et al. (2008) or Aielli (2013) in either the estimation method or in the number of stocks. Therefore, it is considered that the difference in each method is the estimation accuracy of the standardized residual sample covariance matrix, which we use for the correlation targeting.", "Next, we evaluate the accuracy of the covariance matrix estimation using the loss function of Engle et al. (2017). Let \n\n\nΣ\nt\n\n\n denote the N-dimensional “true” covariance matrix at time t, and \n\n\n\nΣ\n^\n\nt\n\n\n be an estimator of \n\n\nΣ\nt\n\n\n. The loss function \n\n\n\nL\nt\n\n\n(\n\n\nΣ\nt\n\n^\n\n,\n\nΣ\nt\n\n)\n\n\n\n and the average loss \n\n\nL\n^\n\n\n are defined below.\n\n\n\n\n\n\n\n\n\nL\nt\n\n\n(\n\n\nΣ\nt\n\n^\n\n,\n\nΣ\nt\n\n)\n\n=\n−\n\n\nT\nr\n(\n\n\n\nΣ\nt\n\n^\n\n\n−\n1\n\n\n\nΣ\nt\n\n\n\n\nΣ\nt\n\n^\n\n\n−\n1\n\n\n)\n/\nN\n\n\n\n[\nT\nr\n\n(\n\n\n\nΣ\nt\n\n^\n\n\n−\n1\n\n\n/\nN\n)\n\n]\n\n2\n\n\n−\n\n1\n\nT\nr\n(\n\nΣ\nt\n\n−\n1\n\n\n/\nN\n)\n\n\n\n\n\n\n\n\n\n\n(42)\n\n\n\n\n\n\n\n\n\n\nL\n^\n\n=\n\n1\nT\n\n\n∑\n\nt\n=\n1\n\nT\n\n\nL\nt\n\n\n\n\n\n\n\n\n\n(43)\n\n", "Table 3 shows the results for \n\n\nL\n^\n\n\n, averaged across \n\n\n\n10\n5\n\n/\nN\n\n\n Monte Carlo simulations.", "We find that the average loss of the cDCC-NLS method is the lowest of the various methods for any number of assets. Therefore, the cDCC-NLS method shows the best estimation accuracy.", "In the previous section, we compared the accuracy of the covariance matrix estimation of each method using a Monte Carlo study. Thus, we were able to confirm that the cDCC-NLS method shows the best estimation accuracy. Next, we examine the effect of the difference in the estimation accuracy on the performance of risk-based portfolios. Here, we use the minimum variance (MV), minimum variance without short constraint (MVS), risk parity (RP), and maximum diversification (MD). We estimate the covariance matrices using the various (c)DCC models for the \n\n\nN\n∈\n{\n100\n,\n500\n,\n1000\n}\n\n\n most liquid stocks in the TOPIX index, as before. Each portfolio is re-balanced monthly, and the parameter estimation period of each method is 60 months. The out-of-sample period is from January 2000 to December 2015. In other words, we estimate the weights on the previous 60 months of data from January 2000, and then compute the value of the out-of-sample portfolio for the following month. Next, we roll the window forward by one month and repeat the process until December 2015.", "We use an annualized Sharpe ratio to evaluate the performance of each portfolio. We also consider whether the cDCC-NLS (the most accurate method) delivers a higher out-of-sample Sharpe ratio than that of the DCC and the cDCC at a level that is statistically significant. For a given sample size N, a two-sided p-value for the null hypothesis of equal Sharpe ratios is obtained using the pre-whitened HACPW method, as described in (Ledoit and Wolf 2008). Table 4, Table 5, Table 6 and Table 7 show the annualized return, annualized volatility, and annualized Sharpe ratio for each risk-based portfolio.", "All risk-based portfolios show improved performance as the number of stocks N increases. For the RP in Table 6 and the MD in Table 7, we confirm that performance does not depend on the estimation accuracy. There are no statistically significant differences between the DCC and cDCC-NLS or between the cDCC and cDCC-NLS. We further confirm that the weights of the RP and MD are similar across the models until December 2015. We consider that this explains why the performance of the RP and MD are similar.", "On the other hand, for the MV in Table 4, the Sharpe ratio of the cDCC-NLS is an improvement over those of the DCC and the cDCC, especially for large numbers of stocks. In addition, the MVS in Table 5, which allows short selling, shows a significant improvement. For the MV and MVS, the cDCC-NLS records the highest Sharpe ratios for any numbers of stocks. According to Scherer (2011), the good performance of the MV portfolio is based on a low-risk anomaly. By being short in high volatility and long in low volatility, low-risk anomalies can be realized. Thus, we think the presence of short sales makes the low-risk anomaly possible. From these results, we conclude the RP and MD do not depend on the estimation accuracy of the covariance matrix, whereas the MV and MVS do depend on the estimation accuracy of the covariance matrix.", "The contribution of this study is twofold. First, we propose the cDCC-NLS method, a highly accurate estimation method that combines nonlinear shrinkage and the cDCC-GARCH model. This method overcomes the difficulties that arise from the cross-section and time series aspects of estimating covariance matrices. We compared the performance of risk-based portfolios under several estimation methods for covariance matrices: the DCC, cDCC, DCC-LS, DCC-NLS, cDCC-LS, and cDCC-NLS. We performed an empirical analysis using a large number of stocks in Japanese markets and confirm the following results:\nThe cDCC-NLS method shows the best estimation accuracy.The RP and MD do not depend on the estimation accuracy of the covariance matrix.The MV does depend on the estimation accuracy of the covariance matrix.", "The cDCC-NLS method shows the best estimation accuracy.", "The RP and MD do not depend on the estimation accuracy of the covariance matrix.", "The MV does depend on the estimation accuracy of the covariance matrix.", "Our recommendations for investors are as follows. When constructing a minimum variance portfolio, especially one that allows short selling, the covariance matrix should be estimated with good estimation accuracy using the cDCC-NLS method. However, for risk parity and maximum diversification portfolios, the estimation accuracy of the covariance matrix is not so important.", "Although not considered in this research, many studies have examined the volatility asymmetry in which volatility tends to show a greater increase after negative returns than it does after positive returns. With regard to the conditional correlation, asymmetry is evident in the correlation between stocks tending to increase after negative returns, as in the case of volatility. In future research, we will investigate the impact on the performance of risk-based portfolios by introducing the asymmetry of volatility and the correlation.", "In this study, we limited our scope to the (c)DCC model in order to estimate the error of covariance matrix. However, it is also important to examine the relationship between the performance of a risk-based portfolio and other estimation methods."], "title": "Risk-Based Portfolios with Large Dynamic Covariance Matrices"}